#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
#### Terraform Apply 📖`skipped`

<details><summary>Show Details</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.yc-vpc.yandex_vpc_subnet.private["10.10.0.0/24"] will be destroyed
  # (because key ["10.10.0.0/24"] is not in for_each map)
  - resource "yandex_vpc_subnet" "private" {
      - created_at     = "2025-04-19T18:37:53Z" -> null
      - folder_id      = "b1gsjjo950i2c5fs82pe" -> null
      - id             = "e2l92nq38a03elos9jon" -> null
      - labels         = {
          - "created_by" = "terraform-yc-module"
        } -> null
      - name           = "subnet" -> null
      - network_id     = "enprc44ml6lbr0llquji" -> null
      - route_table_id = "enpj17760dpbh5vkdrjt" -> null
      - v4_cidr_blocks = [
          - "10.10.0.0/24",
        ] -> null
      - v6_cidr_blocks = [] -> null
      - zone           = "ru-central1-b" -> null
        # (1 unchanged attribute hidden)

      - dhcp_options {
          - domain_name         = "internal." -> null
          - domain_name_servers = [] -> null
          - ntp_servers         = [] -> null
        }
    }

  # module.yc-vpc.yandex_vpc_subnet.private["10.11.0.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet"
      + network_id     = "enprc44ml6lbr0llquji"
      + route_table_id = "enpj17760dpbh5vkdrjt"
      + v4_cidr_blocks = [
          + "10.11.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ private_subnets = {
      - "10.10.0.0/24" = {
          - folder_id      = "b1gsjjo950i2c5fs82pe"
          - name           = "subnet"
          - subnet_id      = "e2l92nq38a03elos9jon"
          - v4_cidr_blocks = [
              - "10.10.0.0/24",
            ]
          - zone           = "ru-central1-b"
        }
      + "10.11.0.0/24" = {
          + folder_id      = (known after apply)
          + name           = "subnet"
          + subnet_id      = (known after apply)
          + v4_cidr_blocks = [
              + "10.11.0.0/24",
            ]
          + zone           = "ru-central1-b"
        }
    }


```

</details>

Results for commit: 0957d9bb07732231975e05aa569002e2f5feed5c

*Pusher: @ptishkin, Action: `pull_request`, Working Directory: `vpc`, Workflow: `Terraform CI/CD`*